import sys
sys.stdin = open("input.txt", "r")

T = int(input())
for tc in range(1, T+1):
    N = float(input())
    result = ''

    while True:
        if N == 0:
            print(f'#{tc} {result}')
            break

        if N * 2 >= 1:
            result += '1'
            N = N * 2 - 1

        else:
            result += '0'
            N = N * 2

        if len(result) > 12:
            print(f'#{tc} overflow')
            break

"""
정수 부분 처리:

처음에는 0.625의 정수 부분이 0입니다.
0을 2로 나눈 나머지는 0입니다. 따라서 결과 문자열에 '0'을 추가합니다.
이후에는 정수부가 0이므로 더 이상 나눌 수 없습니다. 정수 부분 처리가 끝났습니다.
소수 부분 처리:

소수 부분인 0.625에 대해 2를 곱하면 1.25가 됩니다. 이때 정수부는 1입니다. 결과 문자열에 '1'을 추가합니다.
그 다음에는 소수 부분인 0.25에 대해 2를 곱하면 0.5가 됩니다. 이때 정수부는 0입니다. 결과 문자열에 '0'을 추가합니다.
그 다음에는 소수 부분인 0.5에 대해 2를 곱하면 1.0이 됩니다. 이때 정수부는 1입니다. 결과 문자열에 '1'을 추가합니다.
소수 부분이 0이 될 때까지 이 과정을 반복합니다.
"""

