"""
N x N 크기의 땅. 각각의 땅에는 나라가 하나씩 존재.
나라에는 A[r][c]명이 살고 있음. 인접한 나라 사이에는 국경선이 존재. 인구 이동이 없을 때까지 지속

- 국경선을 공유하는 두 나라의 인구 차이가 L명 이상, R명 이하라면, 두 나라가 공유하는 국경선을 오늘 하루 동안 염
- 위의 조건에 의해 열어야하는 국경선이 모두 열렸다면, 인구 이동을 시작
- 국경선이 열려있어 인접한 칸만을 이용해 이동할 수 있으면, 그 나라를 오늘 하루 동안은 연합이라고 함.
- 연합을 이루고 있는 각 칸의 인구수는(연합의 인구수)/(연합을 이루고 있는 칸의 개수)가 된다. 편의상 소수점은 버린다.
- 연합을 해체하고, 모든 국경선을 닫는다.

각 나라의 인구수가 주어졌을 때, 인구 이동이 며칠동안 발생하는지 구하는 프로그램을 작성하시오.
"""
N, L, R = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]