############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.
def over(score_list):
    pass
    # 여기에 코드를 작성합니다.
    # score_cnt라는 60점 이상인 점수의 개수를 셀 변수에 0을 할당하여 초기화
    # 반복문으로 score에 점수를 하나씩 넣고 그 점수가 60점이 넘을 때 score_cnt에 1씩 더하기
    score_cnt = 0
    for score in score_list:
        if score >= 60:
            score_cnt += 1
    # score_cnt 변수 값을 반환
    return score_cnt

# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우 
# 모든 책임은 삭제한 본인에게 있습니다. 
############## 테스트 코드 삭제 금지 #################
scores1 = [30, 60, 90, 70]
print(over(scores1)) # 3
#####################################################