"""
N*N 크기의 정사각형 모양의 방
사람들은 P
계단 입구 S
계단 입구까지 이동 시간  == |PR - SR| + |PC - SC|
PR, PC : 사람 P의 세로위치, 가로위치, SR, SC : 계단 입구 S의 세로위치, 가로위치
== (사람 세로위치 - 계단 세로위치 )+ (사람 가로위치 - 계단 입구 가로위치)

계단을 내려가는 시간은 계단 입구에 도착한 후 부터 완전히 내려갈 때까지
입구에 도착하면 1분 후 아래칸으로 내려 갈 수 있음
계단 위에는 동시에 최대 3명
이미 계단을 3명이 내려가고 있는 경우, 그 중 한 명이 계단을 완전히 내려갈 때까지
계단 입구에서 대기해야 함
계단마다 길이 K가 주어지며, 계단에 올라간 후 완전히 내려가는데 K분이 걸림

모든 사람들이 계단을 내려가 이동이 완료되는 시간이 최소가 되는 소요시간을 출력!

계단이 멀고 긴 곳의 사람을 기준으로 생각해보자
계단까지의 거리 + 계단 길이 + 1분
"""
import sys
sys.stdin = open('input.txt')

T = int(input())
for tc in range(1, T+1):
    N = int(input())
    room = [list(map(int, input().split())) for _ in range(N)]
    # 계단 위치 찾아서 저장
