"""
쇠막대기를 아래에서 위로 겹쳐 놓고, 위에서 수직으로 발사해서 쇠막대기를 자름
자신보다 긴 쇠막대기 위에만 놓을 수 있음
완전히 포함되도록 놓되 끝점이 겹치면 안됌!
레이저는 적어도 하나 이상 있음
레이저는 어떤 쇠막대기의 양 끝점과도 겹치지 않음

레이저는 '()'
쇠막대기의 왼쪽 끝은 '(' / 오른쪽 끝은 ')'로 표현
쇠막대기의 잘린 개수는 범위에 포함된 레이저의 개수 + 1개 이다

쇠막대기 조각의 총 개수를 구하라!
"""
"""
2
()(((()())(())()))(())
(((()(()()))(())()))(()())
"""

T = int(input())
for tc in range(1, T+1):
    arr = input()
    stick = 0   # 쇠막대기 개수
    cnt = 0     # 쇠막대기 조각의 개수
    for i in range(len(arr)):
        if arr[i] == '(':
            stick += 1      # 겹친 쇠 막대 수
        # 레이저일때
        elif arr[i] == ')' and arr[i-1] == '(':
            stick -= 1      # 레이저 이므로 스틱에서 1 빼줌
            cnt += stick    # 레이저 전에 겹쳐있던 스틱들을 조각 개수에 + 해줌
        elif arr[i] == ')':           # 쇠 막대 끝
            cnt += 1    # 조각이 하나 늘고
            stick -= 1  # 겹쳐진 막대 하나 줄기
    print(f'#{tc} {cnt}')